---
kind: other
id: Properties.T:Autodesk.Revit.DB.Visual.AssetPropertyDoubleArray2d
source: html/64a1af18-8187-18f2-04e5-6ad20a4da983.htm
---
# AssetPropertyDoubleArray2d Properties

Identifies if the object is read-only or modifiable.
 If true, the object may not be modified. If false, the object's contents may be modified.